using Microsoft.VisualStudio.TestTools.UnitTesting;
using DataAggregator;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Shouldly;

namespace DataAggregator.Tests
{
    [TestClass()]
    public class LatinGeoFixerTests
    {
        [TestMethod()]
        public void TextIsGeorgianTest()
        {
            LatinGeoFixer.TextIsGeorgian(textToCheck).ShouldBeTrue();
        }

        private static readonly string textToCheck =
            @"ობოლი “აღარც დედა მყავს, არც მამა, აღარც ძმა, აღარც ბიძები, სულ დამელია თვის-ტომი, ტყის ნადირივით ვიზრდები. ტან-ფეხ-შიშველი დავდივარ, ნამტირალევი, მშიერი, მუხთალი რამა ყოფილა წუთისოფელი ცბიერი!” ამას ფიქრობდა ობოლი, მიდ-მოდიოდა ველზედა; აშტერდებოდა ყვავილებს მტირალი თავის ბედზედა. მოფრინდა ჭრელი პეპელა, ობოლს დააჯდა ხელზედა. მოუყვა: “დაო პატარავ, ვიზედა სტირი? რადაო? მეც ობოლი ვარ, გენაცვა, თუმცა მშობლები მყავდაო; აღარავინ მყავს მოწყალე, გამიქრა, დამეკარგაო. მაგრამ არ ვსტირი, ვნავარდობ; ტირილი რაში ვარგაო? მზეს ვუჭვრეტ, ვსუნავ ყვავილებს: იას, ყაყაჩოს, ვარდსაო! ბულბულის სტვენას ყურს ვუგდებ, მითი ვიქარვებ დარდსაო. ობლებს ტირილი რას გვიშველს, რას შევეყრებით კარგსაო? მოდი, პეპელად იქეცი, ვიფრინოთ მთა და ბარსაო!” იმ დროსვე გამოცუნცულდა ჯაგიდან კურდღლის ბაჭია: - “რამ შეგაშინა, დობილო, სახე რად დაგიპრანჭია? სამ დღეს მივლიდა მშობელი, მას შემდეგ სადღაც გამიქრა. ბნელაში დავრჩი, ვტიროდი, რაკი სანთელი ჩამიქრა. მაგრამ არ მოვკვდი, ხომ მხედავ?” ბაჭიამ კისერს ასწია, აწკაპუნებდა ყურებსა, თან ტიკტიკობდა პაწია: - “უდედოდ გამოვიზარდე, მოვლა ვისწავლე თავისა, ბალახის ძოვა, წყალის სმა, მტერზედ დაჭყეტა თვალისა. მეც ობოლი ვარ თქვენსავით, მშობელი აღარ მყავისა! ვენაცვალები მინდვრებსა, უყურეთ, როგორ ჰყვავისა! ნაირ-ნაირი ბალახი, ნაირ-ნაირი ხმებია. შევერთდეთ, დავუკავშირდეთ ერთმანეთს, როგორც დებია. შენც იქ დაგაწვენ, დობილო, ბექობში, საცა ვწვებია. არ გირჩევნია ჩემთანა, რომ მუდამ მარტო ჰრჩებია? გიშოვი საზრდოს უხვადა, რითაც მე ვიკვებებია. რა გინდა, აბა, სოფელში, დახვალ, ტირილით ჰკვდებია?!” ობოლი მისდევს ბაჭიას, წინ მიუძღვება ყურ-ცქვიტა. ვნახოთ, სოროდან თაგუნამ თვალები გამოაჭყიტა. - “მეც თქვენი ძმა ვარ, მიმიღეთ, - მისწრუწუნებდა მგზავრებსა, - მეც ობოლი ვარ, თქვენს მეტი არავინ დამიზავებსა!” მოფრინდა ბერი ქედანი, ობოლს დააჯდა მხარზედა, ჩასჩურჩულებდა ყურშია რაღაცას ტრედის ხმაზედა. ტოროლა თითქოს ჰლოცავდა, დასტრიალებდა თავზედა; კაჭკაჭიც გარსა უვლიდა, თალხები ეცვა ტანზედა: - “ვუშველოთ რამე ობოლსა!” ჭრიალებს, შველა სწადიან. “ვუშველოთ!” ყველა იძახის, რაც მწერნი ადი-დადიან, თუ ფრინველები მინდვრისა... ვინ იცის, რასა სჩადიან! საგრძნობი იგრძნო ყველამა, “ვუშველოთ!” გაიძახიან. ბალახიც მინდორ-ველისა, მწერნი და რანიც ჰყვავიან, იქვე პატარა ნაკადიც აშფოთებულა ძალიან. - “შენი ვარ, თავს შემოგევლე, სხვებისთვის არა მცალიან!” - ანუგეშებდა ობოლსა, მირაკრაკებდა ველადა. მთელი ბუნება ხელებს ჰშლის ჩაგრულის დასაცველადა. საითღაც მოულოდნელად ირემიც გაჩნდა ხელადა, ირემი რქა-ბუდიანი, პირმშოი შვილი მთებისა, ლაღის ნიავის მსუნთქველი და მოტრფიალე შვებისა. უყურეთ ყელ-ყურ ლამაზსა, უყურეთ რასა შვრებისა! - “დამაცათ, მე გავუწიო მაგიერობა დედისა!” სთქვა. ობოლს ტახტად მიუძღვნა ბორჯღი ტოტები რქებისა და გაიტაცა მთისაკენ მოძულებული ძმებისა.";
    }
}