using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace TextAnalyser.Tests
{
    [TestClass()]
    public class ChainSiilarityEvaluatorTests
    {
        [TestMethod()]
        public void EvaluateSimilarityTest()
        {

            var chain0 = new RefinedMarkovChain() { Category = TextCategory.Law };
            #region FeedZgaprebi
            chain0.Feed(@"იყო და არა იყო რა, ღვთის უკეთესი რა იქნებოდა, იყო ერთი ზარმაცი და მუქთამჭამელი კაცი.
ცისმარე დღე კერასთან იჯდა, ხელში ჩხირი ეჭირა და ნაცარს ქექავდა.სწორედ ამიტომ ხალხმა ნაცარქექია შეარქვა.ნაცარქექიას კარგი მეოჯახე ძმები ჰყავდა.კაცო, სულ რომ ნაცარს უზიხარ, ან ჭამა არ გინდა, ან სმა, -ეუბნებოდნენ ყოველდღე, -ადექი, გაისარჯე, იქეთ მიდექ, აქეთ მოდექ და ოჯახში რამე შემოიტანე, თორემ იცოდე, ჩვენ შენი რჩენის თავი აღარა გვაქვს და სახლიდან გაგაგდებთო.
მაგრამ ნაცარქექია ძმების მუქარას ერთ ყურში რომ შეუშვებდა, მეორიდან გამოუშვებდა.მობეზრდათ ძმებს მისი უსაქმურობა და ერთ მშვენიერ დღეს მართლაც გააგდეს სახლიდან.ერთი ხბოს გუდა ნაცრით გაუტენეს და ზურგზე აჰკიდეს, ხელში ჩხირი მისცეს, ჩოხის კალთაში საგზლად ჭყინტი ყველი გამოუხვიეს და გაისტუმრეს.თან გააფრთხილეს: ამ ჩვენი ქვეყნის ფარგლებს გაშორდი, აქ არ დაგიგულოთ, თორემ ცოცხალს არ გაგიშვებთო.კარგითო, -უთხრა ნაცარქექიამ, -ვეცდები, რაც შეიძლება შორს წავიდეო, -და გაუდგა გზას.ბევრი იარა თუ ცოტა იარა, ბოლოს ერთ უშველებელ მდინარეს მიადგა.
შეეშინდა ნაცარქექიას წყალში გასვლისა და მდინარის პირას მხართეძოზე წამოწვა, -იქნებ ვინმემ გამოიაროს და გამიყვანოსო.თურმე ეს მდინარეცა და ადგილიც ცხრათავიანი დევის სამფლობელო ყოფილა.
საღამო ხანზე მოადგა დევი გაღმა ნაპირიდან მდინარეს და დაუწყო წყალს ხვრეპა.დაინახა ნაცარქექიამ და ხაფი ხმით გასძახა: ჰეი, რომელი ხარ, ახლავე აქ გამოდი, მხარზე შემისვი და გაღმა გამიყვანე, ფეხის დასველება მეზარებაო!დევს ძალიან გაუკვირდა, აქ ჩემი შიშით გოლიათებს ვერ გაუვლია და ეს ჭინჭრაქა რის პატრონია, ამას რომ მიბედავსო, და გამოსძახა: ვინა ხარ, რა სულიერი ხარ და მაგ თავხედობას როგორ მიბედავო ? ნაცარქექია დიდი მკვეხარა და ბაქიბუქაც იყო.
შორიდან ისეთ ტრაბახს ატეხდა, რომ კაცს გორის მდრეკავი ეგონებოდა.შემოიყარა დოინჯი და გასძახა დევს: აი, შე ქინქლავ, შენა!ერთი არ მებრალებოდე და გიჩვენებდი, ვინცა ვარ.მაგრამ იცოდე, თუ ჭკუით არ იქნები, ასეთ თავხედობას მეორედ აღარ გაპატიებ.შე ბრიყვო და ბაბაყურო, ხაბირიკა არ გაგიგონია, ნაცარყლაპია, ჩხირით მებრძოლი ? მე სწორედ ისა ვარო!არ მინდა ქვეყანა დავაქციო, თორემ ისეთი ღონე მაქვს, დედამიწას რომ ხელი მოვავლო, ზეცას შევტყორცნი და ნაცარ - მტვრად ვაქცევო.თუ გინდა შევეჯიბროთ და ერთმანეთი ღონეში გამოვცადოთ!შენ მანდ აიღე ქვა, მე აქ ავიღებ, მოვუჭიროთ ორივემ ხელი და, ვინც წვენი გაადინოს, გამარჯვებულიც ის იყოსო.
აიღო დევმა ქვა, მოუჭირა ხელი და სულ დაფშვნა, მაგრამ წვენი ვერ გამოადინა.დაიხარა ნაცარქექია, ვითომ ქვას ვიღებო, ამოიღო ჩოხის კალთაში გამოხვეული ჭყინტი ყველი, მოუჭირა ხელი და წვენი სულ წურწურით გაადინა.გაუკვირდა დევს, ეს ვინა ყოფილაო ? !აბა, ახლა სირბილში გამოვცადოთ ერთმანეთი, -გასძახა ნაცარქექიამ, -გავიქცეთ რიყეზე შენ მაქეთ, მე აქეთ – და ვინც მეტ მტვერსა და კორიანტელს აადენს, ბიჭიც ის იყოს და ქუდიც იმას ეხუროსო!გაძუნძულდა დევი იქითა ნაპირზე და რიყის ქვებს სულ ხრაშახრუში დააწყებინა, მაგრამ მტვერი ვერა და ვერ აადინა.რიყის ქვებს ან რა მტვერი აუვიდოდა!ნაცარქექიამ კი მოიხსნა ნაცრიანი გუდა, გაკუნკულდა ნაპირზე და თან ნაცარი მიმოაბნია.ისეთი მტვერი და კორიანტელი ააყენა, რომ დევმა ვეღარაფერი დაინახა.შეშინდა დევი, ეს მართლაც უძლეველი კაცი ჩანსო, -თქვა გულში და გაღმა ნაპირზე გავიდა, მორჩილად ეახლა ნაცარქექიას, დაიღუნა და მხარზე შეისვა.
შუა მდინარეში რომ შევიდნენ, დევმა, როგორც იქნა, გაუბედა და ჰკითხა: ბატონო, ხაბირიკავ, ნაცრიყლაპიავ და ჩხირით მებრძოლო, ასეთი ღონის პატრონი, როგორღაც მეტისმეტად მსუბუქი მეჩვენებიო.რაო ? მსუბუქიო ? ხა, ხა, ხა, -გადაიხარხარა ნაცარქექიამ, -შენ რომ ჩემი სიმძიმის ამბავი იცოდე, მაგ სისულელეს აღარ წამოროშავდი.რაკი დედამიწას ჩემი ტარება უჭირს, ცაში ღმერთს უხილავი თოკით ვუჭერივარ, თორემ ჩემი სიმძიმე ქვესკნელში ჩაგიტანდაო.დევს ეჭვი შეეპარა, ამ ერთ ციცქნას ისეთი რა სიმძიმე უნდა ჰქონდესო, და ნაცარქექიას მოკრძალებით უთხრა: აბა, ასძახე ღმერთს, რომ სულ ოდნავ შეგიშვას ხელი, მინდა შენი სიმძიმე გავიგოო.ღმერთო მწყალობელო, აბა, ცოტათი მოუშვი თოკი, რომ ამ ბრიყვსა და ავყიას ენა დავამოკლებინოო! – ასძახა ცისკენ ნაცარქექიამ, ჩუმად კი ამოიღო შვინდის გამხმარი ჩხირი და დევს კისერში დააჭირა.დევს ეგონა, მთელი ზეცა ზედ დამაწვაო და შეშინებულმა, მართლა ქვესკნელში არ ჩამაძვრინოსო, ხვეწნა დაუწყო: შენი ჭირიმე, უთხარი ღმერთს, ისევ აგწიოს, თორემ მეტის ატანა აღარ შემიძლიაო.მოაშორა ნაცარქექიამ ჩხირი და დევიც ისევ გაიმართა წელში.ახლა ხომ დარწმუნდი, რა სიმძიმეც მქონიაო ? – ჰკითხა ნაცარქექიამ.მართლაც მეტისმეტად მძიმე ყოფილხარო, -უპასუხა დევმა და შინ მიიპატიჟა.ნაცარქექია ტახტზე დასვა, თვითონ კერა გაახურა და ცომი მოზილა.გააკეთა ერთი უშველებელი ხმიადი, ჩადო კეცში, ცეცხლს მიუფიცხა და ნაცარქექიას უთხრა: თუ უკაცრავად არ ვიყო, ამ პურზე თვალი გეჭიროს, რომ არ დაიწვას, მე ტყეში წავალ და სავახშმოდ ბარემ ნანადირევსაც მოვიტანო.დევი წავიდა.ხმიადს ცალი გვერდი რომ დაებრაწა, ნაცარქექიამ იფიქრა, ახლა კი გადაბრუნების დროაო, და დაუწყო საკეცით წვალება.წვალება - წვალებაში კეცი წამოიქცა და ნაცარქექია ქვეშ მოიყოლა.წვალობს ნაცარქექია, აფხარკალებს ფეხებს, ხვნეშის, ოხრავს, ქშინავს, მაგრამ კეცს ძვრას ვერ უშვრება.დაიღალა და შეშინებულმა ფერიც დაკარგა.მოვიდა დევი და, ნაცარქექია რომ ამ ყოფაში დაინახა, გაკვირვებულმა ჰკითხა, -რა დაგმართნიაო ? რა უნდა დამმართნოდა ? – შეუტია ნაცარქექიამ, -ცოტათი მუცელი წამომტკივდა და ცხელი კეცი დავიდევი.ახლა უკვე კარგად ვარ, მოდი და ამაცალეო.
დევმა კეცი ააცალა და ნაცარქექიაც წამოდგა.ხმიადი გამოცხვა, ნანადირევიც მოხარშეს და ვახშამს შემოუსხდნენ.პურის ჭამაში დევმა ცხვირი დააცემინა და სტუმარი ჭერში შეაგდო.გულგახეთქილი ნაცარქექია თავხეს ჩაეჭიდა და ფხარკალი დაიწყო.მანდ რას აკეთებო ? – ჰკითხა დევმა.რას ვაკეთებ და, აი ეს წკეპლა უნდა გამოვიღო და გვერდები აგიჭრელო, როგორ გაბედე ჩემთან ცხვირის დაცემინებაო ? !ღმერთო, ეს ვინა ყოფილა ? ! – გაოცდა დევი, ამოდენა თავხე მე ძლივს ბოძებზე ავიტანე და ეს კი წკეპლას ეძახის და გამოძრობას უპირებსო.აქაურობას თუ არ გავეცალე, ერთხელაც იქნება, რამეს მიშარებს და ცოცხალი ვეღარ გადავურჩებიო. – დაჰკრა დევმა ფეხი და ცხრა მთას იქით გადაიხვეწა.დევის სახლ - კარი და სიმდიდრე მთლიანად ნაცარქექიას დარჩა, წავიდა, ძმებიც იქ მიიყვანა და უთხრა: ძმებო, მუქთახორობისათვის თქვენ სახლიდან გამაგდეთ, სულ იმას მაყვედრიდით, ოჯახში არაფერი შემოგაქვსო.აი, ახლა ჩემს წილად ეს სახლ - კარი და ქონება - ცხოვრება შემომაქვს, ეს ყველაფერი თქვენთვის დამითმია, ოღონდ ლუკმაპურს ნუღარ დამაყვედრით და ნურც ნაცრის ქექვას დამიშლითო.გადაულოცა ნაცარქექიამ დევის სახლი და სიმდიდრე ძმებს, თვითონ კი აიღო ჩხირი, მიუჯდა კერას და ისევ ნაცრის ქექვა დაიწყო."
);
            chain0.Feed(@"იყო და არა იყო რა, ღვთის უკეთესი რა იქნებოდა. იყო ერთი ბერიკაცი. ეს ბერიკაცი უშვილოდ დაბერებულიყო. ისიც და მისი ცოლიც სულ იმას ევედრებოდნენ ღმერთს, რომ შვილი მიეცა მათთვის. გავიდა ხანი და მიეცათ შვილი, მაგრამ უბედური ბერიკაცი კი მოკვდა. ცოლს მწუხარებით რძე დააკლდა და ბავშვის რჩენა არ შეეძლო. ბავშვი ერთ კოჭლ ირემს მიაბარა და სთხოვა: შენ გამიზარდეო. ბავშვი მიეჩვია ირემს, ტყეში თან დასდევდა და როცა მოუნდებოდა, ძუძუს სწოვდა. იმ არემარეში, სადაც ეს ირემი ცხოვრობდა, ხშირად დადიოდა სანადიროდ მეფის შვილი. ერთხელ ნახა, ბავშვი ირემს რომ დასდევდა. მეფის შვილმა დაანება ნადირობას თავი და გასწია შინისკენ. შინ რომ მივიდა, მამამ ჰკითხა: შვილო, რატომ არ ინადირეო? შვილმა არა უპასუხა, მხოლოდ სთხოვა – ეშოვა მისთვის სამოცდაათი ფუთი ჯაჭვი და ასოცი კაცი ჯაჭვის მსროლელი.
მამამ წადილი აუსრულა, უშოვა ჯაჭვიცა და კაცებიც. წავიდნენ სანადიროდ. ტყეში რომ მივიდა ხელმწიფის შვილი, ეძება ბავშვი და, როცა იპოვა, თავის კაცებს უბრძანა დაეჭირათ. ესროლეს ქამანდი და შემოახვიეს ბავშვს, მაგრამ ბავშვმა რომ გაიწია, ჯაჭვი გაწყვიტა და გაიქცა.
გაწყვეტილი ჯაჭვი მოხვდა კაცებს და მეფის შვილის გარდა ყველანი დაიხოცნენ. შინ რომ მივიდა ხელმწიფის შვილი, მამას მოახსენა: ჩემი წადილი თუ არ ავისრულე, თავს მოვიკლავო. მამამ უთხრა: შვილო, რა არის მაგისთანა, რომ თავს იკლავო. შვილმა მიუგო: ერთი პატარა ბავშვი ვნახე ტყეში, კოჭლ ირემს დასდევსო და ვერ დავიჭირეო.
მამამ კიდევ გაატანა რამდენიმე ფუტი ჯაჭვი, კაცები, მაგრამ ვერც ახლა დაიჭირეს.
ხალხი დაიხოცა, ჯაჭვი გაწყვიტა და გაიქცა ასე ხუთჯერ. ბოლოს დაიჭირეს და მოიყვანეს შინ, ირემიც თან მოჰყვა. ბავშვი ტიტველა იყო და ლაპარაკი არ იცოდა.
ხელმწიფის შვილმა ამ ბავშვს ოთახი მისცა. როცა მოშივდებოდა, ძირს ჩამოვიდოდა, ირემთან მივიდოდა და ძუძუს მოსწოვდა. ხელმწიფის შვილმა იფიქრა: ვასწავლი საჭმლის ჭამას და ტანთ ჩაცმასაო.
სადილობისას და ვახშმობისას შედიოდა მასთან, გაშლიდა სუფრას, მოიტანდა საჭმელს, ხელ-პირს დაიბანდა და დაჯდებოდა პურის საჭმელად. ასე მოდიოდა ახალახალ ტანისამოსჩაცმული.
მერე ეს ბავშვიც ისე მოიქცა, როგორც მეფის შვილი: ადგებოდა, ჩაიცვამდა, კანკალით დაიბანდა პირს და დაჯდებოდა პურის საჭმელად. დიდხანს იყო ასე. ერთხელ მეფის შვილმა თვალი მოჰკრა, სიხარულით შევარდა მამის ოთახში და შეატყობინა ეს ამბავი. მამამ უთხრა: შემოიყვანეთ სასახლეში და ჩვენთან იცხოვროსო. ჯერ ვერ ლაპარაკობდა, მაგრამ მათთან ცხოვრებამ ლაპარაკიც ასწავლა და კიდეც შეაჩვია ამათ.
სანადიროდ ისა და ხელმწიფის შვილი ერთად დადიოდნენ. მაგრამ ირმისა უფრო ღონიერი იყო. ზევით ისარს რომ აისროდა და მიწაზე ჩამოვარდნილი დაესობოდა, მისი ამოძრობა ხელმწიფის შვილს არ შეეძლო, ირმისა კი ადვილად ამოაძრობდა ხოლმე.
ერთხელ ხელმწიფე სხვაგან წაბრძანდა. გასაღები ჩააბარა ირმისას და უთხრა: ჩემმა შვილმა თუ გამოიღვიძოს და გითხრას: დამატარე ოთახებიო, თერთმეტი ოთახი აჩვენე, მეთორმეტეში კი არ შეიყვანო, არ დაღუპოო.
წავიდა მეფე. ადგა მეფის შვილი და უთხრა: ოთახები მაჩვენეო. ირმისა დასთანხმდა, მხოლოდ მეთორმეტეში არ შეიყვანა: ეს შენი საქმე არ არისო. ხელმწიფის შვილმა იშიშვლა სატევარი და უთხრა: თუ არ გააღებ, შენც მოგკლავ და თავსაც მოვიკლავო.
ირმისა ადგა და გააღო. გააღო თუ არა, დაინახა სურათი ერთი საოცარი ქალისა. ხელმწიფის შვილი ცოცხალ-მკვდარი დაეცა. ირმისამ წამოაყენა, დააწვინა ოთახში და უთხრა: შენ ოღონდ კარგად იყავი და მე გიპოვნი იმასაო.
ხელმწიფე რომ მოვიდა, ნახა და უსაყვედურა: რად მომკალი, რად აჩვენე ის სურათიო?! ირმისამ უთხრა: მე მოვგვრი იმ ქალს, ოღონდ წასვლის ნება მომეცითო. ხელმწიფემ წასვლის ნება დართო და ორნივ წავიდნენ.
იარეს დიდხანს, წელიწადი დაჰყვეს გზაში. ბოლოს მივიდნენ ერთ ზღვის პირს, აქ იდგა ერთი ძირი ვაშლის ხე,ზედ ვაშლები ესხა. ირმისამ უთხრა ხელმწიფის შვილს: ჩამოაგდე ვაშლიო. ხელმწიფის შვილმა ვერ შესძლო. მაშინ ირმისამ მუშტი ჰკრა, ჩამოყარა ვაშლები და დასხდნენ საჭმელად. ზღვიდან ამოვიდა ერთი დევი და ყვიროდა: ვინ არის, რომ პაპიჩემის დარგულ ვაშლსა სჭამს, ახლავ გავათავებო. ირმისამ უპასუხა: აქ მოდი და საკადრისს მოგახსენებო.
დევი მივიდა თუ არა, ირმისამ ჰკრა მუშტი და მოკლა. ამოვიდა მეორე დევი. ისიც იმას ამბობდა, რასაც პირველი. ირმისამ ესეც მოკლა. მესამე დევი სხვაგან ყოფილიყო და რომ მოვიდა, იმანაც ასეთი ყვირილი მორთო. ირმისამ შესძახა: მოდი, შენი ამხანაგები აქ არიან და ნახეო. მოვიდა თუ არა, ირმისა ეცა და დაიწყეს ჭიდაობა: დიდხანს იჭიდავეს; როგორც იყო, ირმისამ დასძლია და მოკლა დევი. ადგა, ჩამოყარა ვაშლი, ჩაიწყო უბეში და ზოგიც ხელში დაიჭირა; ორი ხელმწიფის შვილს მისცა და წამოვიდნენ თავიანთ გზაზე.
იარეს დიდხანს, მივიდნენ ერთ დევის სახლში. აქ ნახეს ორი დევის ქალი. ამათ უთხრეს: ყმაწვილებო, გირჩევთ ახლავ წახვიდეთ, თორემ დევები მოვლენ და შეგჭამენო. არ დაუჯერა ირმისამ და დაჯდა ჩრდილოში. ამოიღეს ვაშლები და დაიწყეს ჭამა. დევის ქალები მორბილდნენ და მუქარის მაგიერ, რაც კი შეიძლებოდა, პატივი სცეს. როცა ისინი ვაშლს შეექცეოდნენ, სამი ძმა დევი მოვიდა. – რა სულიერი ხართ, ჩემს სახლში მოსულხართ და ჩრდილში დამჯდარხართო?  – ჰკითხა ერთმა დევმა. ირმისამ მიუგო: მოდი და გეტყვიო. დევი მივიდა თუ არა, ირმისა ეცა, წააქცია და ზედ მუცლით შედგა.
მევიდა მეორე დევი, განუმეორა პირველი დევის სიტყვები. ესეც წააქცია ირმისამ და ერთიმეორეზე დააწვინა. მოვიდა მესამე დევი და დაიღრიალა: ვინ არის იმისთანა, რომ ჩემი ძმები ერთმანეთზე დააწვინა და მოკვლას უპირებს, რომ აქვე გავათავოო. ირმისამ უთხრა: მოდი აქ და მე გეტყვი, ვინცა ვარო. მოვიდა თუ არა, დაუწყო მუშტის ქნევა. ირმისამ სტაცა ხელი, წააქცია, სამივე ძმა ერთმანეთზე დააწვინა და უთხრა: მოგკლათ თუ არაო? დევები შეეხვეწნენ: დღეიდან ჩვენც თქვენი ძმები ვიქნებით და თქვენც ჩვენი ძმები იყავითო. აიშვა ირმისამ და შევიდნენ სახლში.
დევებმა მასპინძლობა გაუმართეს ხელმწიფის შვილსა და ირმისას. მერე ურჩიეს, რა გზით უნდა წასულიყვნენ ქალთან. აქეთ თუ წახვალთ, ოცდაათ დღეს მოუნდებით, მაგრამ უშიშრად მიხვალთ. მეორე გზით თუ წახვალთ, ათ დღეში მიხვალთ, მაგრამ დევები არიან მძლავრები და შეგჭამენო. თუ ამ დევებს გადაურჩით, მერე მიხვალთ იმ ქალთან. როცა დაღამდება, ლოგინს დაგიგებთ, საჭმელს გაჭმევთ და დაგაწვენთ. სწორედ მაშინ, როცა იმ ქალს შენთან მოპარვა მოუნდება, მე აქედან ისარს ვისვრი. თუ ის ქალი მოგეპარა და თითზე ბეჭედი ისე გაგიკეთა, რომ ვერ გაგეღვიძა, უსათუოდ მოგკლავს. ამიტომ ვახშმის შემდეგ არ დაიძინოთ იმ ქალის სახლში. ჩვენ უთუოდ ისარს ვისვრით და მაშინ დაიჭირეთ ის ქალიო.
წავიდნენ ორივენი. იარეს დიდხანს და მივიდნენ ერთი დევის სახლში.
დევი იწვა და ტყვედ მოყვანილი ქალი ბუზებს უგერიებდა. დაინახა თუ არა ეს ყმაწვილები, ქალმა უთხრა: აქედან წადით ჩქარა, თორემ როცა დევი გაიღვიძებს, მეც შემჭამს და თქვენცაო. ირმისამ უთხრა: შენ აქ ჩამოდი და ის მე ვიცი, დევი რასაც იზამსო. ქალმა მიუგო: ბუზები დაეხვევა, გამოიღვიძებს და დაგვხოცავსო. ირმისამ უთხრა: აქ ჩამოდი, აქაო. ჩამოვიდა ქალი. დევს გამოეღვიძა და შეჰყვირა: ვინ წამართვა ჩემი საკბილო ცხოველიო. ირმისამ უთხრა: მე გახლავარო!
გაბრაზებული დევი ჩამოვიდა და შეება ირმისას. დაიწყეს ბრძოლა. დიდი ხნის შემდეგ ირმისამ დასძლია და მოკლა დევი. ირმისამ წაიყვანა ქალი და ჩააბარა იმ სამ დევს, როგორც თავიანთი და.
წამოვიდნენ ისევ, იარეს დიდხანს. მივიდნენ ერთ სასახლეში, ნახეს, რომ დევების ქორწილია. შევიდნენ ეზოში. დაინახა თუ არა დევების უფროსმა, ჩამოგზავნა იმათი ვინაობის შესატყობად. შეიტყვეს, რომ სხვა რჯულისანი იყვნენ. ჩამოგზავნა ხელმეორედ: დახოცეთ ეს კაცები, თუ არ ამოვიდნენ ჩვენთანაო. მაგრამ ირმისამ ეს დევი უცებ მოკლა. როცა შეიტყვეს დევი მოჰკლესო, ჩამოგზავნეს სხვა დევი, ისიც მოკლა. ასე, რომ ყველა დახოცა. ახლა ჯერი მიდგა უფროს დევზე.
ჩამოვიდა თუ არა უფროსი დევი, მაშინვე ეძგერა ირმისას. დაიწყეს ჭიდაობა. იჭიდავეს დიდხანს. დევმა მოიქნია ირმისა და მუხლამდე ჩასვა მიწაში. მერე ირმისამ მოიქნია დევი და მიწაში ჩასვა წელამდე. ბოლოს მაინც ირმისამ აჯობა: ჩასვა მიწაში თავებამდე და მერე ხელი მიჰყო ამ თავების მოჭრას. დევი ასთავიანი იყო, მოსჭრა ოთხმოცდაცხრამეტი თავი და უთხრა: რომელი გირჩევნია, სიკვდილი თუ სიცოცხლე? დევმა მიუგო: სიცოცხლე მირჩევნია, ოღონდ ამიშვი და ჩემი საცხოვრებელი შენთვის მომიციაო. როცა ამოვიდა, ისევ ჩხუბი დაუწყო, მაგრამ ისევ ირმისამ დასძლია. მაშინ დევმა უთხრა: ცა და ღმერთი ზევით და მიწა და წყალი ქვევით თავდებად გქონდეს, ოღონდ ამიშვი და ჩემს ღონეს მეფის შვილს მივცემო.
აუშვა, დაუტოვა მეფის შვილი ამას და თვითონ წავიდა.
წასვლისას დევს უთხრა: შენ ამას ასწავლე სუყველაფერი შენი ხერხი და ღონე, თორემ როცა გამოვივლი, მოგკლავო.
წავიდა ირმისა. მივიდა იმ ქალთან, რომელსაც ეძებდნენ. საღამო იყო. ქალმა ვახშამი აჭამა, დაუგო ლოგინი და დააწვინა. როცა გავიდა ერთი საათი, მივიდა ის ქალი, აიღო ბეჭედი და თითზე უნდა გაეკეთებინა. მაშინ სამმა დევმა ისარი ისროლეს. სტაცა უცებ ხელი ირმისამ ამ ქალს თითში. ქალმა უთხრა: მე შენი ბედის ვყოფილვარო და გაიკეთა ბეჭედი თითზე. ირმისამ მიუგო: ჩემთვის კი არა, ჩემი ძმისათვის მინდიხარ ცოლადაო.
დილა რომ გათენდა, ქალმა გასცა ბრძანება დევების ქალაქში სუყველას მოეტანა მისთვის თითო ხელი ძვირფასი ქვეშაგები ძღვნად: სხვა რჯულის კაცზე გავთხოვდიო.
მეორე დღე რომ გათენდა, დევები მოგროვდნენ ირმისასთან და ეს ქალი თავისი მზითევით წამოიყვანეს მეფის შვილთან. მაშინ მეფის შვილი ისევ დევის სახლში იყო ხერხისა და ღონის სასწავლებლად. მეფის შვილთან რომ მივიდნენ, ნახეს, რომ ნაცარში იჯდა და ღონის მომატება კი არა, რაც ღონე ჰქონდა, ისიც წართმეოდა.
მივიდა ირმისა დევთან და უთხრა: რა არის, რატომ პირობა არ შეასრულეო? დევმა მაშივნე თავის ღონე მისცა მეფის შვილს ირმისას ბრძანებით. ირმისამ მოკლა დევი, იმის ქონება მთლად წამოიღო და ყველა ერთდ წამოვიდა.
იმ სამ ძმა დევთან რომ მივიდნენ, გამართეს კიდევ ქორწილი. სამ დღეს აქ დარჩნენ, მერე წამოვიდნენ. დიდხანს იარეს და მივიდნენ იმ ვაშლის ძირში. იმ ღამეს იქ იყვნენ დევები, მეფის შვილი, ირმისა და ხუთი ქალი: სამი ქალი სამი ძმა დევის და იყო. ერთიც ის, რომელიც დევს წაართვა, მეხუთეც ცოლი მეფის შვილისა. იმ ღამეს ყველანი დაწვნენ და დაეძინათ. ირმისასაც მიეძინა.
ამ დროს მოფრინდა ერთი რაღაცა ცხოველი და მეფის შვილის ცოლი ჰაერში აიტაცა. ირმისა უცებ წამოხტა, გააღვიძა ამხანაგები და უთხრა: ხომ ხედავთ, რომ დევმა წაიყვანა მეფის შვილის ცოლიო.
მეფის შვილს ეწყინა, მაგრამ რას იზამდა. ირმისამ დევებს უთხრა: თქვენ აქ იყავით, სანამ არ მოვიდე, თორემ ყველას დაგხოცავთო. დევები დათანხმდნენ და იქ დარჩნენ, ირმისა და მეფის შვილი კი წამოვიდნენ.
იარეს დიდხანს. მივიდნენ ერთი დევის სახლში. დევი სანადიროდ წასულიყო. მოტაცებული ქალი ეზოში დასეირნობდა. ირმისა და მეფის შვილი რომ დაინახა, ძალიან გაუხარდა და უთხრა: წადით ახლავე, თორემ მოვა ჩემი ქმარი დევი და ორივეს შეგჭამთო. მაგრამ ირმისამ უთხრა: შენ იმას გეხვეწებით, რომ შეგვიტყვე, სადა აქვს მას თავისი სულიო. – კარგიო, – უთხრა ქალმა და ადგილი დაუნიშნა, რომ ერთი თვის შემდეგ მოსულიყვნენ.
წავიდნენ ირმისა და მეფის შვილი და დადგნენ ერთ გამოქვაბულში. როცა დევი მოვიდა, თავის ცოლს ჰკითხა: არავინ მოსულაო? მან უპასუხა: არავინაო. ერთი კვირის უკან ცოლმა დევს უთხრა: შენი სული სად არის, რომ შემოვწირო რამეო. დევმა უთხრა: ჩემი სული შენ რად გინდაო. ცოლმა უთხრა: როგორ რად მინდა. რასმე შევწირავ, რომ სცხონდე და ჩემთვისაც კარგი იყოსო. დევმა უთხრა: ჩემი სული სვეტშიაო.
ქალმა ეს სვეტი ისე შეღება, რომ იმის შეხედვას არა სჯობდა რა. დევმა რომ ეს ნახა, უთხრა: ჩემი სული თუ ასე გიყვარს, ამ კატაში არისო.
ცოლმა ეს კატა ისე გაალამაზა, მეტი არ შეიძლებოდა. უკერავდა კარგსა და კარგს ტანისამოსს და აცმევდა. ეს რომ ნახა დევმა, უფრო მოეწონა და უთხრა: ჩემი სული ცხრა მთას იქით არისო. ერთს ხეზე ჩამოკიდებულია ცხრათავიანი დევი. იმას შიგნით უზის ირემი. ირემში შველია, შველში კურდღელი, კურდღელში არის ბაჭია, ბაჭიაში – კოლოფი და იმ კოლოფში სამი მერცხალი, – ორი მერცხალი არის ჩემი თვალები და ერთი ჩემი სულიაო.
გაუხარდა ქალს, რომ ყველაფერი შეიტყო, მეორე დღეს უნდა მოსულიყვნენ მეფის შვილი და ირმისა.
როგორც მოვიდნენ, ქალმა ყველაფერი უამბო, რაც დევისაგან გაეგონა. იმათ წასვლა დააპირეს, მაგრამ ქალმა უთხრა: ისევ თავი დაანებეთ, რადგან ის დევი, რომელიც ხეზეა ჩამოკიდებული თუ სუნი მიუვიდა ადამიანისა, დიდ მანძილზე მიიზიდავს და შეჭამსო. ირმისამ უთხრა: ნუ გეშინია, მე იმას მოვუხერხებ და ხელში ჩავიგდებო. ორივენი წავიდნენ.
ირმისამ და მეფის შვილმა დიდხანს იარეს, მივიდნენ ერთი ხის სიახლოვეს, გაიარეს ცხრა მთა. მივიდნენ თუ არა ხის ძირში, მეფის შვილი ააკანკალა დევის შუქმა, მაგრამ ირმისამ გაამაგრა. როცა ორიოდე ადლის სიახლოვეს მივიდნენ, ორივენი დააბრმავა შუქმა. მაგრამ, როგორც იყო, ირმისამ გაჭრა თოკი, ჩამოვარდა დევი, მოსჭრა ამ დევს ცხრა თავი, გაჭრა შუაზე, ამოიყვანა ირემი. ისიც გაჭრა, ამოიყვანა შველი, ისიც გაჭრა, გამოხტა კურდღელი. სტაცა ხელი კურდღელს და გაჭრა. შიგ ნახა ბაჭია. ისიც გაჭრა და ამოიღო კოლოფი.
ამ დროს გახდა ავად დევი. ირმისამ გახსნა კოლოფი, ამოიყვანა ერთი მერცხალი და მოკლა. მაშინ დევს ცალი თვალი დაუბრმავდა. მივიდა დევთან ირმისა და უთხრა: ეს ქალი რომ წამოიყვანე, ეგ იმიტომ მოგივიდაო. მაშინ დევმა თქვა: ქალს რომ კაცი დაენდოს, ქვეყანას დააქცევინებსო. ირმისამ ამოიყვანა მეორე მერცხალი და ისიც მოკლა. დევი ორივე თვალით დაბრმავდა.
წამოიყვანეს ქალი და მოვიდნენ იმ ვაშლის ძირში. იქ დახვდათ მათ სამი დევი. იმ ღამეს იქ დარჩნენ, მაგრამ ირმისას არ დასძინებია, რადგან ეშინოდა, კიდევ არავინ წამართვას ქალიო.
როცა შეიქნა შუაღამე, მოვიდა სამი ქაჯი, შემოსხდნენ ვაშლის წვეროზე და დაიწყეს ლაპარაკი. ერთმა თქვა: რა ბედი მიეცეს ამ ცოლ-ქმარსაო. მეორემ თქვა: ის ბედი მივცეთ, რომ როგორც შევიდეს სიძე ეზოში და ცხენი გამოათამაშოს, ცხენიდან გადმოვარდეს და მოკვდესო. მეორემ თქვა: თუ ამას გადარჩეს, ხელმწიფის ცოლმა მოართვას სარტყელი და ოქროს ფეხსაცმელი, მაშინ სარტყელი გველად გადაიქცეს და ქალი შეჭამოს და იმას თუ გადარჩეს, ფეხსაცმელმა ფეხი მოსტეხოსო. მესამემ კიდევ სთქვა: თუ ამასაც გადარჩეს, ღამე მოვიდეს გველეშაპი და ორივე ჩანთქასო. თუ ამას ვინმე ყურს უგდებდეს და გააცხადოს, ქვაგრილად იქცესო. ამას ყურს უგდებდა ირმისა, მაგრამ არავის უთხრა.
მეორე დღეს შინ წამოვიდნენ. როგორც შევიდნენ ყველანი ეზოში, იმ დროს მეფის შვილმა გადაჰკრა ცხენს და უნდოდა გაეთამაშებინა, მაგრამ ირმისამ არ გაუშვა, ცხენს აღვირი დაუჭირა და ჩამოხტნენ ცხენებიდან.
დედამთილმა მიართვა რძალს ოქროს სარტყელი და ფეხსაცმელი, მაგრამ ირმისამ გამოართვა, დაამტვრია და გადაყარა.
ამას ყველაფერს გადარჩნენ, მაგრამ ის ღამე კი საშიში იყო.
ირმისამ იმ ღამეს არ დაიძინა. საცა ცოლ-ქმარი იწვა, იმ ოთახს დარაჯობდა. შუაღამისას მივიდა გველეშპი. ირმისამ მოკლა ისა, გამოიტანა, ერთ სახლში შეიტანა და იქ დააგდო, თვითონ დაწვა და დაიძინა. როცა ადგა, ეს სახლი შელესა.
გაიმართა ქორწილი და სამი დღე გასტანა.
ამის შემდეგ ყველამ ერთად მშვიდობიანად და ბედნიერად დაიწყო ცხოვრება.");
            chain0.Feed(@"ერთხელ დედა ძალიან გააბრაზა გელამ. წადი, მომშორდი, დაუყვირა დედამ და ზურგი შეაქცია.
„დედას არ ვყვარებივარო“, – გაიფიქრა გელამ და ოთახიდან ფეხაკრეფით გაიპარა.კარგა ხანს იწრიალა ეზოში.რაკი დედა უკან არ გაეკიდა და თავისებურად არ მოეფერა, დაამტკიცა, ნამდვილად არა ვყვარებივარო.ეზოდანაც შეუმჩნევლად გაუჩინდარდა და სასოფლო გზას დაადგა.
მიდის გელა და უკან არ იყურება.სოფელს რომ გასცდა, ტყე დაიწყო, მაგრამ ვერც ტყემ შეაშინა.მიდის და მიდის უკანმოუხედავად.შემოხვდა მგელი.
– სად მიდიხარო ?
– დედაზე უკეთესს ვეძებო.
– ახლავე შეგჭამდი, მაგრამ ბატკანით გამაძღარი ვარ და, სულ ერთია, უკან არ ჩამოივლიო ?
მგელმა პირიც არ ახლო და გზას ბარაქა დააყარა გელამ.
შემოხვდა დათვი.
– სად მიდიხარო ?
– დედაზე უკეთესს ვეძებო.
– ახლავე შეგჭამდი, მაგრამ ბევრი თაფლი გეახელი და… სულ ერთია, უკან არ ჩამოივლიო ?
დათვმა პირიც არ ახლო და გელამ ისევ გზა განაგრძო.
შემოხვდა ბერიკაცი!
– სად მიდიხარ, კარგო ბიჭოო ?
– დედამ სახლიდან გამომაგდო და უკეთესს ვეძებო.
– შვილად აგიყვანდი, მაგრამ დედობას მაინც ვერ გაგიწევ და რა გაეწყობაო.
მიდის გელა, მიდის და შემოხვდა დედაბერი.
– სად მიდიხარ, ლამაზო ბიჭოო ?
– დედაჩემმა სახლიდან გამომაგდო და დედაზე უკეთესს ვეძებო.
– შვილად აგიყვანდი, მაგრამ რაკი დედას გამოჰქცევიხარ, ჩემთანაც არ გაჩერდებიო.
დედაბერმაც განი მისცა და გელამ ისევ გზას ბარაქა დააყარა.
ბევრი იარა თუ ცოტა იარა, ერთ პატარა მდინარეს გადააწყდა.მდინარის ნაპირას ვიღაც ტიტლიკანა ბიჭი ჩხირკედელაობდა.გელას დანახვაზე ფეხზე ადგა და მისკენ წამოვიდა.
– ვინა ხარ და საით გაგიწევიაო ?
– დედამ შინიდან გამომაგდო და დედაზე უკეთესს ვეძებო.
– დედა რა არისო ?
– დედა ის არის, ვინც გაგაჩინაო.
– არ ვიცი, ვინ გამაჩინაო.
– როცა წაიქცევი, ვინ წამოგაყენებს და დაგაჩუმებს ხოლმეო ?
– არავინ არ წამომაყენებს ხოლმე.მე თვითონა ვდგები და ვჩუმდებიო.
– საჭმელს ვინ გიმზადებსო ?
– საჭმელი ხეებს ასხია.პანტა - მაჟალოთი გავდივარ იოლას.ზოგჯერ კენკრასაც ვშოულობო.
– ჩაის ვინ გიდუღებს და გასმევსო ?
– ჩაი არც გამიგია, წყალსა ვსვამო.
– მაშ არ იცი, დედა რა არის და შვილი რა არისო ?
– არ ვიცი.ოღონდაც გამაგებინე და მშვილდ - ისარს გაგითლიო.
მშვილდ - ისრის ხსენება ძალიან გაუხარდა გელას, მაგრამ მაინც ყოყმანი დაიწყო:
– მე შინიდან გამომაგდო და შენ რას გიზამსო ?
– მაინც მაჩვენე და თუ არ მომეწონება, ისევ აქ წამოვიდეთო.აი, ეს მდინარე მთლიანად ჩემია.ხან ასე ვიხტუნოთ და ხანაც ისე, აქ ვიცხოვროთ და კენკრა ვჭამოთო.
გელას ძალიან მოეწონა ტიტლიკანა ბიჭის აზრი.ტანზე თავისი პერანგი ჩააცვა, ასე სირცხვილიაო, ჩაჰკიდა ხელი და უკან დაბრუნდნენ.
შემოხვდათ დედაბერი.
– ბიჭს ბიჭი მიმატებია და ორი შვილი გამხდომიაო.
– ამ პატარა ბიჭმა დედა არ იცის, რა არის.უნდა ვაჩვენო და მერე მოგივალო.
– რაკი დედასთან მიდიხართ, თქვენთან რა ხელი მაქვსო ? !
შემოხვდათ ბერიკაცი.
– მოზვერს მოზვერი მიმატებია და უღელი გამხდომიაო.
– ეს ბიჭი დედაჩემთან უნდა წავიყვანო და თუ დედაჩემი არ მოეწონა, შენთან მოვალთო.
– რაკი დედასთან მიდიხართ, რა გაეწყობაო ? !
შემოხვდათ დათვი.
– ლუკმას ლუკმა დამატებია და ისევ კარზე მომდგომიაო, ახლა ორივეს შეგახრამუნებთო.
– ამ პატარა ბიჭმა დედა არ იცის, რა არის, ვაჩვენებ და მერე მოგივალთო.
– რაკი დედასთან მიდიხართ, მიპატიებია.დედის ცრემლისა ძალიან მეშინიაო.
იარეს, იარეს და შემოხვდათ მგელი.
– ფერდებიც დამცარიელებია და ბიჭებიც თავიანთი ფეხით მოსულანო.
– ჯერ ნუ შეგვჭამ, ამ პატარა ბიჭმა დედა არ იცის, რა არის და დედასთან მიმყავსო.
– რაკი დედასთან მიდიხართ, შეჭმას ვეღარ გაგიბედავთ.დედის წყევლისა ძალიან მეშინიაო.
მგელიც ჩამოეცალათ და ბიჭები სოფლის გზას გაუდგნენ.
იარეს, იარეს და… ეზოში რომ შევიდნენ, დედა კიბეზე იჯდა და მწარედ მოთქვამდა.სულ ცრემლად იღვრებოდა.
– აგერ, დედა რა არისო, – დაანახვა გელამ.
დედამ გაიგო შვილის ხმა.წამოხტა, ეცა და გულში ჩაიკრა.ხან ტიროდა და ხან იცინოდა.ჰკოცნიდა და ეხვეოდა.შვილის ალერსით რომ გული იჯერა, მაშინღა შენიშნა უცხო ბიჭი.
– ეს კარგი ბიჭი საიდან მოიყვანეო ?
– დედა არა ჰყავს და შენთან წამოვიყვანეო.
დედამ შვილს ხელი გაუშვა და პატარა ბიჭს მოეხვია:
– იუ, შვილო, რა ცოდო ხარ, რომ დედა არა გყოლია… შენ გენაცვალე და შენი ჭირიმე, დარჩი ჩემთან და ჩემი შვილის ძმა იყავი, ძმა მაინც არა ჰყავსო.
პატარა ბიჭი სიხარულისაგან ატირდა.ამან უფრო აუჩვილა დედას გული.
– ნუ ტირი, შვილო!..ნუ ტირი, შემოგევლე!..დარჩი ჩემთან და აღარსად წახვიდე!ლამაზ შარვალსაც შეგიკერავ და ჭრელ წინდებსაც მოგიქსოვ.
– არ წავიდეთ ? ! – წასჩურჩულა გელამ.
– მე აქედან ფეხს არ მოვიცვლი და შენ სადაც გაგიხარდება, იქ წაბრძანდიო");
            #endregion

            var chain1 = new RefinedMarkovChain() { Category = TextCategory.Medical };

            #region Feed
            chain1.Feed(@"მენინგოკოკური ინფექცია – მენინგოკოკებით გამოწვეული დაავადება, რომელიც მიმდინარეობს მწვავე ნაზოფარინგიტის, ჩირქოვანი მენინგიტისა და მენინგოკოკცემიის სახით. მიეკუთვნება ჰაერ-წვეთოვან ანთროპონოზებს. ფართოდაა გავრცელებული მენინგოკოკების ჯანმრთელი მტარებლობა.

მენინგოკოკური ინფექციის ეპიდემიოლოგია. დაავადების წყარო – ავადმყოფი მენონგოკოკური ინფექციის კლინიკურად გამოხატული გამოვლინებებით (ნაზოფარინგიტი, მენინგიტი), აგრეთვე მენინიგოკოკების მტარებლები. ინფექციის გადაცვემა ხდება ჰაერ – წვეთოვანი გზით. დაავადების რიცხვის ზრდა აღინიშნება წელიწადის ცივ და ნესტიან დროს. ვლინდება როგორც ერთეული (სპორადული) შემთხვევები, ასევე ეპიდემიური აფეთქებები; ეს უკანასკნელი ხშირად ვითარდება საბავშვო კოლექტივებში და საერთო საცხოვრებლებში.

მენინგოკოკური ინფექცია 2მენინგოკოკური ინფექციის ეტიოლოგია, პათოგენეზი. მენინგოკოკები წარმოადგენენ წყვილად განლაგებულ, გრამუარყოფით სფერულ წარმონაქმნებს; ცერებროსპინალურ სითხეში ლოკალიზდებიან უჯრედის შიგნით და აქვთ ყავის მარცვლის მსგავსი ფორმა. გარემოში სწრაფად იღუპებიან; არსებობს გამომწვევის სხვადასხვა სეროტიპები; მგრძნობიარენი არიან პენიცილინის, ლევომიცეტინის, ტეტრაციკლინების მიმართ. ინფექციის კარია ზედა სასუნთქი გზების ლორწოვანი გარსი. უმრავლეს შემთხვევაში მენინგოკოკების არსებობა ლორწოვან გარსზე არ იწვევს დაავადების განვითარებას (მტარებლობა). ზოგიერთ დაინფიცირებულებში ვითარდება მწვავე ნაზოფარინგიტის სურათი, და მხოლოდ ზოგიერთებთან მენინგოკოკი აღწევს სისხლში, ჰემატოგენურად აზიანებს სხვადასხვა ორგანოებსა და სისტემებს (მენინგოკოკემია). ზოგჯერ ცვლილებები ლოკალიზდება უპირატესად ტვინის გარსებში (ცერებროსპინალური მენინგიტი). შესაძლებელია ინფექციურ-ტოქსიკური შოკის განვითარება.

მენინგოკოკური ინფექციის სიმპტომები. ინკუბაციური პერიოდი 2 – 10 დღე. ეპიდემიური მენინგოკოკური მენინგიტი, როგორც წესი, იწყება მწვავედ. თუმცა შემთხვევათა დაახლოებით 15% – ში აღინიშნება პროდრომული პერიოდი საერთო სისუსტის, ოფლიანობის, ზომიერი თავის ტკივილის, 1 – 2 დღის განმავლობაში ტემპერატურის უმნიშვნელო მომატების სახით. პატარა ბავშვებში, შემცივნების შემდეგ, ხშირია ღებინებები, 6 – 8 საათის განმავლობაში სხეულის ტემპერატურა იმატებს 39,5 – 40 გრადუსამდე, ვითარდება მძაფრი თავის ტკივილი, რომელიც მალე შემაწუხებელი ხდება. ავადმყოფი საწოლში ღებულობს იძულებით პოზას, (,,მწევარის პოზა” უკან გადაწეული თავით და მუცელთან მიტანილი ფეზებით). მენინგოკოკური ინფექცია 3ავადმყოფის დათალიერებისას, იძულებითი პოზის გარდა, ყურადღებას იქცევს სახის ჰიპერემია, შეხებით ცხელი კანი, ჰიპერესთეზია, მყარი, წითელი დერმოგრაფიზმი. ზოგიერთ ავადმყოფს უვითარდება ჰერპესული ან პეტექიალური გამონაყარი. აღინიშნება დარღვევები თავის ქალის ნერვების მხრიდან: კონვერგენციის და აკომოდაციის დარღვევა, სიელმე (სტრაბიზმი), მარჯვენა და მარცხენა თვალის გუგების არათანაბარი გაფართოება. (ანიზოკორია). ზოგიერთ ავადმყოფს აღენიშნება გონების დაბინდვა, იშვიათად – ბოდვა, შეაწუხებელი მოძრაობა და კუნთოვანი კრუნჩხვები. დამახასიათებელია მენინგეალური სინდრომის განვითარება: კეფის კუნთების რიგიდობა, კერნინგის დადებითი სიმპტომი. რიგ შემთხვევებში ვითარდება სხვა სიმპტომებიც – ბრუდძინსკის (ზედა და ქვედა), გორდონისა და ოპენჰეიმის. სისხლში ვლინდება ნეიტროფილური ლეიკოციტოზი (35 – 45 . 109/ლ) მარცხნივ გადახრით. ზურგის ტვინის პუნქციისას, მაღალი წნევის ქვეშ ვღებულობთ მუქ, ჩირქოვან სითხეს, რომელიც შეიცავს ცილების, ნეიტროფილური ლეიკოციტების დიდ რაოდენობას; პანდისა და მენინგოკოკური ინფექცია 4ნონე – აპელტის რეაქციები დადებითია. თუ ზურგის ტვინის სითხე აღებულ იქნა ანტიბიოტიკებით მკურნალობის დაწყებამდე, მაშინ პრეპარატების გრამით წესით შეღებვის შემდეგ მათში მოჩანს მენინგოკოკები. იშვიათად მენინგიტმა შეიძლება მიიღოს გახანგრძლივებული მიმდინარეობა. ეპიდემიური მენინგიტის მძიმე მიმდინარეობისას, პროგნოზი ყოველთვის სერიოზულია, შესაძლებელია გართულებების განვითარება (თავის ქალის ნერვების პარეზები და დამბლები, თავის ტვინი შეშუპება, ჩირქოვანი პროცესები – ოტიტები, სინუსიტები, მასტოიდიტები.). პატარა ბავშვებში, ჩირქოვანი მენინგოკოკური მენინგიტის შორეული გართულება და გამოსავალი შეიძლება იყოს თავის ტვინის წყალმანკი, რომელსაც თან სდევს თავის ზომების მნიშვნელოვანი და მყარი ზრდა, ქალის ნაკერების დაშორება. ანტიბიოტიკებით ადრე დაწყებულმა და სწორმა მკურნალობამ შეიძლება მიგვიყვანოს დაავადების სასურველ შედეგამდე (დაავადების დაწყებიდან მე – 12 – მე – 14 დღეზე). ზემოთ აღწერილი, მენინგოკოკური ეპიდემიური მენინგიტის ტიპიური სურათის გარდა, შესაძლებელია შეგვხვდეს მისი მენინგოკოკური ინფექცია 5ვარიანტებიც. კერძოდ, ელვისებური ფორმა, რომელიც იწყება ძალიან მწვავედ (გონების დაბინდვა, მაღალი ტემპერატურა, განმეორებითი ღებინება, საერთო კრუნჩხვები, თავის უკან გადაგდება, სასუნთქი და გულ – სისხლძარღვთა სისტემების ღრმა დარღვევები, თავის ტვინის შეშუპება), სასწრაფო, ინტენსიური თერაპიის გარეშე, 12 – 24 საათის შემდეგ შეიძლება განვითარდეს სიკვდილი. მენინგიტის ენცეფალიტურ ფორმას თან სდევს გონების დაკარგვა, კუნთვითი კრუნჩხვები, სხადასხვა ჯგუფის კუნთების პარეზი; აღნიშნული ფორმა ძირითადად გვხვდება მცირე ასაკის ბავშვებში. გვხვდება აგრეთვე დაავადების მსუბუქად, ატიპიურად მიმდინარე ფორმები; ასე მაგალითად აბორტული ფორმის დროს აღინიშნება მწვავე დაწყება, ცხელების ხანმოკლე პერიოდი, თავის ტკივილი, კეფის კუნთების რიგიდობა; დაავადების დაწყებიდან 2 – 3 დღის შემდეგ, ანტიბიოტიკოთერაპიის გარეშეც, ტემპერატურა ქვეითდება ნორმამდე, უკუვითარდება მენინგოკოკცემიადაავადების სხვა კლინიკური სიმპტომებიც.

მენინგოკოკცემია იწყება მწვავედ, მიმდინარეობს მძიმე სეფსისის კლინიკური სურათით, მაღალი ცხელებითი რეაქციებით. დაავადების დაწყებიდან დაახლოებით ერთი დღე – ღამის შემდეგ სახის, ქვედა კიდურების კანზე ჩნდება ინტენსიური ვარდისფერი ან მოლურჯო ელფერის როზეოლური და პაპულოზური ელემენტები, აგრეთვე – წვრილი, ჰემორაგიული ელემენტები და არასწორი, ვარსკვლავის ფორმის წითელი ლაქები, რომლებიც შემდგომ ნეკროზდებიან (გამონაყრის ელემენტის ცენტრში კანი ღებულობს მუქ ლურჯ, თითქმის შავ ელფერს). ამის გარდა, შეიძლება განვითარდეს საკმაოდ დიდი ზომის ჰემორაგიული ლაქები. ცალკეულ ავადმყოფებში, მენინგოკოკცემიას თან სდევს ართრიტები, ამასთან უპირატესად ზიანდება წვრილი სახსრები. ცალკეულ შემთხვევებში მენინგოკოკცემია იწვევს ჩირქოვანი მენინგიტის განვითარებას. სასწრაფოდ დაწყებული ინტენსიური მკურნალობის გარეშე, ვითარდება უმძიმესი ინფექციურ – ტოქსიკური შოკი, თირკმელზედა ჯირკვლის მწვავე უკმარისობა (უოტერჰაუს – ფრიდერიქსენის სინდრომი), მძიმე კოლაფსი, თირკმლის მწვავე უკმარისობა.

მენინგოკოკური ინფექცია 6

მენინგოკოკური ინფექციის დიაგნოზი. დაავადების ამოცნობა ხდება ეპიდემიოლოგიური და კლინიკური მონაცემების საფუძველზე, მენინგიტის გამოვლინების შემთხვევაში დიდი მნიშვნელობა ენიჭება ზურგის ტვინის სითხის გამოკვლევას. დიფერენციალური დიაგნოზის ჩატარება ხდება სხვა ეტიოლოგიის ჩირქოვან მენინგიტებთან (პნევმოკოკური, სტაფილოკოკური, სტრეპტოკოკური და სხ.), ჰემორაგიული გამონაყრის არსებობის შემთხვევაში – პარტახტიან ტიფთან, მენინგოკოკცემიის შემთხვევაში – სეფსისთან, ჰემორაგიულ ცხელებებთან, წამლისმიერ დაავადებებთან.

მენინგოკოკური ინფექცია 7

მენინგოკოკური ინფექციის გართულებები: ინფექციურ-ტოქსიკური შოკი, თირკმელზედა ჯირკვლების მწვავე უკმარისობა, ტვინის შეშუპება. აუცილებელია დიფერენცირება სხვა ჩირქოვან მენინგიტებთან. დაავადების დამადასტურებელია მენინგოკოკის გამოყოფა ცერებროსპინალური სითხიდან ან სისხლიდან.

მენინგოკოკური ინფექციის მკურნალობა. განსაკუთრებით ეფექტურია ადრე დაწყებული პენიცილინოთერაპია.

მენინგოკოკური ინფექციის პროგნოზი ადრე დაწყებული და ადეკვატური მკურნალობის დროს კეთილსაიმედოა. მძიმე ფორმებისა და არადროულად დაწყებული მკურნალობის დროს შესაძლებელია ლეტალური გამოსავალი. რეკონვალესცენტები უნდა იმყოფებოდნენ ექიმის მეთვალყურეობის ქვეშ.
პროფილაქტიკა. ავადმყოფთა გამოვლინება და იზოლაცია.");
            chain1.Feed(@"ხმაური ყურებში
ხმაური ყურებში ეს არის სმენითი შეგრძნება, რომელიც წარმოიშვება მაშინ, როდესაც ირგვლივ სიჩუმეა. არჩევენ ფიზიოლოგიურ და პათოლოგიურ ხმაურს. ფიზიოლოგიური ხმაური ჯანმრთელ ადამიანს შეიძლება სრული სიჩუმის პირობებში გაუჩნდეს.
 
 
პათოლოგიური ხმაური ყურებში წარმოიშვება ამა თუ იმ გადახრისას. ის შეიძლება იყოს როგორც ობიექტური, ისე სუბიექტური. ობიექტური პათოლოგიური ხმაური სუბიექტურისაგან იმით განსხვავდება, რომ ის ესმის არა მარტო ავადმყოფს, არამედ ექიმს ფონეიდოსკოპის გამოყენებისას. ობიექტური ხმაური იშვიათად შეიმჩნევა და ჩვეულებრივ განპირობებულია ყელის კუნთების შეკუმშვით ევსტახის მილში, სისხლის დინების ცვლილებით ძარღვებში, მაგ.: მათი შეკუმშვის, ან პათოლოგიური გაფართოებისას საფეთქელ-ქვედაყბის სისხლძარღვის პათოლოგიისას, დაფის მიდამოში წნევის ცვლილებით.
 
სუბიექტური პათოლოგიური ხმაური ესმის მხოლოდ პაციენტს. ხმაური ამ შემთხვევაში წარმოადგენს შუა ან შიგნითა ყურის პათოლოგიის ნიშანს, მაგრამ შეიძლება წარმოიშვას სხვა ორგანოებისა და სისტემების დაავადების დროსაც (ჰიპერტონია, ჰიპოტონია, თავის ტვინის სისხლძარღვების ათეროსკლეროზი, ხერხემლის კისრის ნაწილის ოსტეოხონდროზი, ანთებითი დაავადებები, თავის ტვინის სიმსივნეები და სხვა.)
 
უფრო ხშირად ხმაური ყურებში შეიმჩნევა მენიერის, ათეროსკლეროზის, სმენის ნერვის ნევრიტის, ზოგიერთი ოტიტის ფორმის დაავადებებისას. ყურებში პათოლოგიური ხმაურის წარმოქმნის მექანიზმს უკავშირებენ ხმის გამტარობის დარღვევას, ასევე, სმენის ანალიზატორების ნერვული უჯრედების გაღიზიანებას.
 
დიაგნოსტიკის ჩასატარებლად და ხმაურის წარმოშობის ზუსტი მიზეზების დასადგენად ატარებენ აუდიომეტრიას (ხმაურის სპექტრის სიხშირისა და ინტენსივობის გამოკვლევა ელექტრული აპარატის დახმარებით). ბგერის გამტარი სისტემის დარღვევისთვის დამახასიათებელია დაბალი ტონალობის ხმაური. მაღალსიხშირიანი სპექტრის ხმაური (რეკვისა და სტვენის მსგავსი) შეიმჩნევა ავადმყოფებში, რომელთაც დაზიანებული აქვთ ბგერის მიმღები აპარატი.
 
ყურებში ხმაურის პირველადი გამოვლენის, ან მისი ხასიათის შეცვლის შემთხვევაში, აუცილებელია, ექიმთან ვიზიტი. ყურებში ხმაურის წარმოშობა შეიძლება განპირობებული იქნეს ოტოტოქსიური მოქმედების მქონე პრეპარატებით მკურნალობისას. ასევე, ყურებში ხმაური შეიძლება განუვითარდეთ იმ ადამიანებსაც, რომლებიც მუშაობენ ხმაურისა და ვიბრაციის პირობებში. შეიძლება, სმენის ნერვის ნევრიტის დასაწყისიც იყოს.
 
ცალმხრივი ხმაური ყურში ხშირად წარმოადგენს პირველ ნიშანს კარიბჭელოკოკინა ნერვის ნევრომისა. ხმაურის გაძლიერება და მისი ტონალობის მომატება მენიერის დაავადებისას, შეიძლება იყოს წინაპირობა მწვავე ვესტიბულური დისფუნქციის შეტევისა.
 
ყურში ხმაურის მკურნალობა მიმდინარეობს კომპლექსურად: მედიკამენტურ მკურნალობასთან ერთად გამოიყენება რეფლექსოთერაპია, მაგნიტოთერაპია, ელექტრუსტიმულაცია.");
            #endregion

            var chain2Determine = new RefinedMarkovChain();
            #region chain2detFeed
            chain2Determine.Feed(@"ვენერიული დაავადებები, ანუ სქესობრივი გზით გადამდები დაავადებები, სქესობრივი ინფექციები)
 
 
დაავადებები, რომლებიც მოცემულ ჯგუფში გაერთიანებულია ერთიანი გადაცემის გზის საფუძვლად. სქესობრივი გზით გადამდები დაავადებები (სქესობრივი ინფექციები) გადადის მხოლოდ სქესობრივი გზით (მათ შორის, ორალური და ანალური კონტაქტითაც) ინფიცირებულ პარტნიორთან დაუცველი სქესობრივი კავშირის დროს. დღეს ცნობილია ოცზე მეტი ვირუსული სქესობრივი ინფექცია. პრეზერვატივის გამოყენების აუცილებლობის ფართო პროპაგანდის მიუხედავად, ბევრი იგნორირებას უკეთებს ამას, რაც მრავალ ქვეყანაში, მათ შორის უკრაინაში, ინფიცირებულთა რიცხვის ზრდას იწვევს.
 
სქესობრივი გზით გადამდები დაავადებების სიმპტომები:
 
თეთრი, ლორწოვანი, მწვანე, ქაფიანი, სუნიანი და უსუნო გამონადენი შარდსაწვეთი არხიდან (ურეთრიდან), ქავილი და ტკივილი შარდსაწვეთ არხში, მოშარდვის გახშირებული მოთხოვნილება;
•    ტკივილები საზარდულის არეში;
•    შესაძლოა, სხეულის ტემპერატურის მატება (ეს სიმპტომი შეიძლება არც გაჩნდეს);
•    მამაკაცებში – ტკივილი სათესლე პარკში, რომელიც შეიძლება კუდუსუნისა და წელის არეში გავრცელდეს;
•    ქალებში – გამონადენი საშოდან (თეთრი, ლორწოვანი, მწვანე, ქაფიანი, სუნით და უსუნოდ);
•    შესაძლოა, განვითარდეს მენსტრუალური ციკლის დარღვევები.
ბევრ ადამიანს, რომელიც ნარკოტიკებს მოიხმარს, ვენერიული დაავადებების სიმპტომები ეცვლება, ან ძალიან სუსტად უვლინდება.
 
მწვავე დაავადება ბევრად უფრო იოლად იკურნება, ვიდრე “სტაჟიანი”. სქესობრივი გზით გადამდები დაავადებების დროული დიაგნოსტიკა და ანალიზი ხელს უწყობს უსწრაფეს გამოჯანმრთელებას. ქრონიკულმა სქესობრივმა ინფექციებმა შეიძლება ორგანოებში “კვალი” დაიტოვოს შეხორცებების სახით, რომლებიც დარჩება იმ შემთხვევაშიც კი, თუ მიკრობები აღარ იქნება.
 
თუ დაავადების რომელიმე ნიშანს აღმოაჩენთ, დაუყოვნებლივ მიმართეთ ექიმს. ყველა დაავადებას ხშირად მსგავსი სიმპტომები, მაგრამ სხვადასხვა გამომწვევები აქვს და ინფიცირებიდან მხოლოდ გარკვეული დროის შემდეგ ვლინდება. ზოგჯერ სპეციალისტებსაც კი უჭირთ დიაგნოზის დასმა, ამიტომ, უმეტეს შემთხვევაში, იმისათვის, რომ ზუსტად ის მკურნალობა დაინიშნოს, რომელიც საჭიროა, პაციენტმა აუცილებლად უნდა ჩააბაროს ანალიზები ლაბორატორიაში და გაიაროს სპეციალური გამოკვლევა. ზუსტი დიაგნოზის დასმა შეუძლებელია მხოლოდ სიმპტომების საფუძვლად, რადგან ეს ინფექციები იშვიათად გვხვდება ცალკე. ხშირად ასეც ხდება, რომ თუ ადამიანი დაინფიცირდა რაიმეთი, ერთდროულად რამდენიმე დაავადებას იძენს (ურეაპლაზმა, ტრიქომონადა და ა.შ.). გახსოვდეთ, რომ როდესაც დაავადება ქრონიკულ სტადიაში გადავა, მისი განკურნება მნიშვნელოვნად გართულდება.
სქესობრივი გზით გადამდები დაავადებების მკურნალობისას ექიმი-სპეციალისტის გვერდის ავლა შეუძლებელია. ამ დაავადებებისათვის სახლის პირობებში დამზადებული და ხალხური საშუალებები არ არსებობს! არავითარ შემთხვევაში არ დაიწყოთ თვითმკურნალობა, არ გამოიყენოთ ფართოდ რეკლამირებული წამლები მკურნალ ექიმთან წინასწარი კონსულტაციის გარეშე. ამან შეიძლება მძიმე, ხშირად კი შეუქცევადი შედეგები გამოიწვიოს.
 
სქესობრივი გზით გადამდები დაავადებების მკურნალობის ძირითადი პრინციპი – ინფექციების დროული დიაგნოსტიკა და სქესობრივი პარტნიორების ერთდროული მკურნალობაა იმ შემთხვევაშიც კი, თუ ერთ-ერთი მათგანის ანალიზს დაავადება არ გამოუვლენია. ასეთ შემთხვევაში, მკურნალობის კურსის გავლა მაინც აუცილებელია, რადგან ის შეიძლება დაავადების უსიმპტომო მატარებელი იყოს.
 
 
 
ძირითადი დაავადებები – სქესობრივი გზით გადამდები დაავადებები ან ინფექციები:
სიფილისი;
გონორეა;
გენიტალური ჰერპესი;
პაპილომა-ვირუსული ინფექცია (გენიტალური მეჭეჭები);
კონდილომა;
ტრიქომონიაზი;
ქლამიდიოზი;
კანდიდოზი;
ბოქვენის პედიკულოზი;
მიკოპლაზმოზი;
აივ-ინფექცია, შიდსი..
უროგენიტალური ინფექციები ბევრად უფრო სერიოზული პრობლემაა, ვიდრე ტკივილი და დისკომფორტი, რომელსაც ეს ინფექციები იწვევს. ძირითადი საშიშროება გართულებებშია, რომლებიც შეიძლება უშვილობისა და თვითნებური აბორტების მიზეზი გახდეს. ინფექციებმა, რომლებიც ბავშვს ინფიცირებული დედისგან გადაედება, შეიძლება მისი გონებრივი და ფიზიკური განვითარება გააუარესოს, გამოიწვიოს რიგი უკურნებელი დაავადებების განვითარება. სქესობრივი ინფექციების მკურნალობა ორივე პარტნიორში – მომსახურება, რომელსაც სწრაფად და ანონიმურად მიიღებთ “ოქსფორდ მედიქალის” სამედიცინო კლინიკაში.");

            #endregion

            var evaluator = new ChainSimilarityEvaluator();

            var f0to1 = evaluator.EvaluateSimilarity(chain0, chain1);
            var f1to0 = evaluator.EvaluateSimilarity(chain1, chain0);

            var f2to0 = evaluator.EvaluateSimilarity(chain2Determine, chain0);
            var f0to2 = evaluator.EvaluateSimilarity(chain0, chain2Determine);

            var f2to1 = evaluator.EvaluateSimilarity(chain2Determine, chain1);
            var f1to2 = evaluator.EvaluateSimilarity(chain1, chain2Determine);



            Assert.Fail();
        }
    }
}